Информационная_база/src/Documents/БухгалтерскаяОперация/БухгалтерскаяОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БухгалтерскаяОперация</name>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>СчетДт</name>
    <type>
      <types>ChartOfAccountsRef.БухУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.БухУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Информационная_база/src/AccountingRegisters/РегистрБухгалтерии/РегистрБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Информационная_база/src/Documents/БухгалтерскаяОперация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	
	
	Движения.РегистрБухгалтерии.Записывать = Истина;
	Движение = Движения.РегистрБухгалтерии.Добавить();
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	Движение.СчетДт = СчетДт;
	Движение.СчетКт = СчетКт;



КонецПроцедуры
